[![londonr-banner-logo](../images/londonr-banner.png)](https://www.londonr.org/)

<div style = "text-align: right"><font size = 3 color = "#B22222" face = "verdana"><b>- LondonR - Python for R Users - </b></font></div>
<div style = "text-align: right"><font><i>By 'Dayo Oguntoyinbo</i></font></div>
<div style = "text-align: right"><font>16th December 2019</font></div>

# Part B - PyR Introduction and others

**A. PyR - Basic Commom Commands**

| Python | Description | R | 
| --- | --- | --- | 
| `conda install pkg-name` | Package installation |  `install.packages('pkg-name')` | 
| `import pkg-name` | Load or Call a Package |  `library('pkg-name)` | 
| `del('obj')` | Delete object |  `rm('obj)` |

**B. PyR - Arithmetic Operators**

| Python | Description | R | 
| --- | --- | --- | 
| `+` | addition |  `+` | 
| `-` | subtraction |  `-` | 
| `/` | division |  `/` | 
| `*` | multiplication |  `*` | 
| `**` | exponent |  `^ or **` | 
| `%` | modulo |  `%%` |

**C. PyR - Relational Operators**

| Python | Description | R | 
| --- | --- | --- | 
| `<` | Less than |  `<` | 
| `>` | Greater than |  `>` | 
| `<=` | Less than or equal to |  `<=` | 
| `>=` | Greater than or equal to |  `>=` | 
| `==` | Equal to |  `==` | 
| `!=` | Not equal to |  `!=` |

**D. PyR - Logical Operators**

| Python | Description | R | 
| --- | --- | --- | 
| `AND` | AND |  `&&, &` | 
| `OR` | OR | `\|\|, \|` | 
| `NOT` | NOT |  `!` |

**E. PyR - Calling Libraries or Packages**

| Python | Description | R | 
| --- | --- | --- | 
| `import package` | Libraries/Packages |  `library(package)` | 
| `import package as pk` |  |  | 
| `from mymodule import mypackage` |  |  |

**F. PyR - Writing Functions**

| Python | Description | R | 
| --- | --- | --- | 
| `def py_funtion(...): ` | Writing functions |  `r_function <- function(...){}` | 

`Python`
```Python
def py_function(x, y, z):
    """
    docstring
    """
    a = x + y + z
    return a
```

`R`
```R
r_function <- function(x, y, z){
    a <- x + y + z
    return(a)
    }
```

**G. PyR - For loop**

| Python | Description | R | 
| --- | --- | --- | 
| `for j in range(0, 10): print(j - 2)` | Writing functions | `for (j in 0:10){print(j - 2)}` | 

`Python`
```Python
for j in range(0, 10):
    print(j - 2)
```

`R`
```R
for (j in 0:10){print(j - 2)}
```

In [1]:
for j in range(0, 10):
    print(j - 2)

-2
-1
0
1
2
3
4
5
6
7

**H. PyR - If Else**

| Python | Description | R | 
| --- | --- | --- | 
| `if ...: elif ...: else:` | if else | `if ... {} else if .. {} else {}` | 

`Python`
```Python
def py_zero_neg_pos(number):
    if number == 0:
        print("Number is zero.")
    elif number < 0:
        print("Number is negative.")
    else:
        print("Number is positive.")        
```

`R`
```R
r_zero_neg_pos <- function(number){
    if (number == 0){
        print("Number is zero.")
    }
    else if (number < 0){
        print("Number is negative.")
    }
    else {
        print("Number is positive.")
    }
}
```

In [2]:
# Tell whether number is zero, negative or positive 
def py_zero_neg_pos(number):
    """
    Tell whether number is zero, negative or positive 
    """
    if number == 0:
        print("Number is zero.")
    elif number < 0:
        print("Number is negative.")
    else:
        print("Number is positive.")

In [3]:
py_zero_neg_pos(-123)

Number is negative.

**I. PyR - Python Collections**

| Python | Description | R | 
| --- | --- | --- | 
| `[]` | list |  `c()` | 
| `len(...)` | list len | `length(...)` | 
| `...[0]` | access list |  `...[1]` | 
| | access list |  `[[1]]` or `\$` | 


1. **List**: Ordered and changeable; and allows duplicate members.
2. **Tuple**: Ordered and unchangeable (immutable); and allows duplicate members.
3. **Set**: Unordered and unindexed; allows no duplicate members.
4. **Dictionary**: Unordered, changeable and indexed; allows no duplicate members and works based on key:value pairs.

**Note:**
- Indexing in Python starts from `0` unlike `R` that starts from `1`.
- Negative indexing implies beginning from the end. `-1` -> last item, `-2` -> second to the last item.
- Index range: start:end, where desired end is `-1` the end value.

In [4]:
# List
britain = ["london", "bristol", "chippenham"]

In [5]:
britain

['london', 'bristol', 'chippenham']

In [6]:
# Last index
britain[-1]

'chippenham'

In [7]:
# First to Second index
britain[0:2]

['london', 'bristol']

In [8]:
# First to Last index
britain[0:4]

['london', 'bristol', 'chippenham']

In [9]:
# First to Last index
britain[0:3]

['london', 'bristol', 'chippenham']

In [10]:
# Index 0 to index 4
britain[:3]

['london', 'bristol', 'chippenham']

In [11]:
# Index 2 to end
britain[1:]

['bristol', 'chippenham']

In [12]:
# Change index 2
britain[1] = "manchester"

In [13]:
# For loop through list
for cities in britain:
    print(cities)

london
manchester
chippenham

In [14]:
# If item exist in list
if "london" in britain:
    print("Yes, it is in britain list.")

Yes, it is in britain list.

In [15]:
# If item not exist in list
if "barcelona" not in britain:
    print("Not in britain list")

Not in britain list

In [16]:
# If item not exist in list
if "barcelona" in britain:
    print("Not in britain list")

In [17]:
# Length of List
len(britain)

3

In [18]:
# Add items to list
britain.append("glasgow")

In [19]:
britain

['london', 'manchester', 'chippenham', 'glasgow']

In [20]:
# Add list to list
new_cities = ["hull", "brighton"]
britain.append(new_cities)

In [21]:
britain

['london', 'manchester', 'chippenham', 'glasgow', ['hull', 'brighton']]

```python
# Insert item
britain.insert("cardiff")

---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)
<ipython-input-39-ee60bf219596> in <module>
      1 # Insert item
----> 2 britain.insert("cardiff")

TypeError: insert() takes exactly 2 arguments (1 given)
```

In [22]:
# Insert item
britain.insert(3, "cardiff")

In [23]:
britain

['london',
 'manchester',
 'chippenham',
 'cardiff',
 'glasgow',
 ['hull', 'brighton']]

In [24]:
# Remove list item
britain.remove(new_cities)

In [25]:
britain

['london', 'manchester', 'chippenham', 'cardiff', 'glasgow']

In [26]:
# Tuple
france = ("paris", "lille", "bordeaux", "toulouse", "marseille")

In [27]:
france[-1]

'marseille'

In [28]:
france[2:4]

('bordeaux', 'toulouse')

In [29]:
# Immutable tuple, still mutable
france_list = list(france)
france_list[4] = "orlean"
france = tuple(france_list)
france

('paris', 'lille', 'bordeaux', 'toulouse', 'orlean')

In [30]:
# For loop through tuple
for cities in france:
    print(cities)

paris
lille
bordeaux
toulouse
orlean

In [31]:
# Tuple Unpackingh
a, b = (23, -3)

In [32]:
a

23

In [33]:
b

-3

In [34]:
# Set example
spain = {"madrid", "sevilla", "mallorca", "barcelona"}

In [35]:
# Dictionary example
# key: value
europe = {
    "britain": "london",
    "france": "paris",
    "germany": "berlin",
    "finland": "helsinki"
}

In [36]:
# Accessing a dictionary
europe["britain"]

'london'

In [37]:
# Accessing a dictionary
europe.get("britain")

'london'

In [38]:
# Change key-value
europe["britain"] = "greater london"

In [39]:
europe

{'britain': 'greater london',
 'france': 'paris',
 'germany': 'berlin',
 'finland': 'helsinki'}

In [40]:
# Loop over dictionary
# Prints keys
for countries in europe:
    print(countries)

britain
france
germany
finland

In [41]:
# Loop over dictionary
# Prints values
for countries in europe:
    print(europe[countries])

greater london
paris
berlin
helsinki

In [42]:
# Loop over dictionary
# Prints values
for countries in europe.values():
    print(countries)

greater london
paris
berlin
helsinki

In [43]:
# Loop over dictionary
# Prints keys-values
for countries, capitals in europe.items():
    print(f'{countries}: {capitals}')

britain: greater london
france: paris
germany: berlin
finland: helsinki

In [44]:
# Nested Dictionary
countries = {
    "africa": {
        "country": "nigeria",
        "capital": "abuja",
        "currency" : "naira"
    }, 
    "asia" : {
        "country": "india",
        "capital": "delhi",
        "currency" : "rupee"  
    },
    "europe": {
        "country": "uk",
        "capital": "london",
        "currency" : "pounds"
    },
    "oceania": {
        "country": "new zealand",
        "capital": "wellington",
        "currency" : "new zealand dollar"
    }
}

In [45]:
countries

{'africa': {'country': 'nigeria', 'capital': 'abuja', 'currency': 'naira'},
 'asia': {'country': 'india', 'capital': 'delhi', 'currency': 'rupee'},
 'europe': {'country': 'uk', 'capital': 'london', 'currency': 'pounds'},
 'oceania': {'country': 'new zealand',
  'capital': 'wellington',
  'currency': 'new zealand dollar'}}

In [46]:
countries['oceania']['country']

'new zealand'

In [47]:
# Individual nested Dictionary
africa = {
    "country": "ghana",
    "capital": "accra",
    "currency" : "ghana-cedi"
    }

asia = {
    "country": "china",
    "capital": "beijing",
    "currency" : "yen"  
    }

europe = {
    "country": "finland",
    "capital": "helsinki",
    "currency" : "euro"
}

oceania = {
    "country": "papua new guinea",
        "capital": "port moresby",
        "currency" : "papua new guinean kina"
}

# Combine dictionaries to one dictionary
continent_countries = {
    "africa": africa,
    "asia": asia,
    "europe": europe,
    "oceania": oceania
}

In [48]:
continent_countries["oceania"]

{'country': 'papua new guinea',
 'capital': 'port moresby',
 'currency': 'papua new guinean kina'}

In [49]:
# Python Dict to JSON
import json

# Converts to JSON:
countries_json = json.dumps(continent_countries)
continent_countries

{'africa': {'country': 'ghana', 'capital': 'accra', 'currency': 'ghana-cedi'},
 'asia': {'country': 'china', 'capital': 'beijing', 'currency': 'yen'},
 'europe': {'country': 'finland', 'capital': 'helsinki', 'currency': 'euro'},
 'oceania': {'country': 'papua new guinea',
  'capital': 'port moresby',
  'currency': 'papua new guinean kina'}}

In [50]:
# Python Object and JSON strings

# Dictionary -> json object
json_dict = json.dumps({"country": "britain", "capital": "london"})
print(json_dict)
print(type(json_dict))

{"country": "britain", "capital": "london"}
<class 'str'>

In [51]:
# List -> json array
json_list = json.dumps(["london", "bristol", "chippenham"])
print(json_list)
print(type(json_list))

["london", "bristol", "chippenham"]
<class 'str'>

In [52]:
# Tuple -> json array
print(json.dumps(("london", "bristol")))

["london", "bristol"]

In [53]:
# str -> json string
print(json.dumps("londonr"))

"londonr"

[`json_normalize`](https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html)

In [54]:
# Flattening JSON object in Python
from pandas.io.json import json_normalize

In [55]:
json_normalize(countries)

,africa.country,africa.capital,africa.currency,asia.country,asia.capital,asia.currency,europe.country,europe.capital,europe.currency,oceania.country,oceania.capital,oceania.currency
0,nigeria,abuja,naira,india,delhi,rupee,uk,london,pounds,new zealand,wellington,new zealand dollar

In [56]:
results = [
    {
        "altitude": 35,
        "location": {
            "lat": 42.97,
            "lng": -81.25
        },
        "location_id": 2056,
        "status": "OK"
    },
    {
        "altitude": 19,
        "location": {
            "lat": 42.11,
            "lng": -81.91
        },
        "location_id": 1979,
        "status": "NOK"
    },
    {
        "altitude": 52,
        "location": {
            "lat": 43.01,
            "lng": -81.00
        },
        "location_id": 2030,
        "status": "OK"
    },
    {
        "altitude" : 89,
        "location" : {
            "lat" : 41.99,
            "lng" : -80.14
        },
        "location_id": 2009,
        "status": "OK"
    },
    {
        "altitude": 20,
        "location": {
            "lat": 40.19,
            "lng": -81.00
        },
        "location_id": 1999,
        "status": "NOK"
    }
]

In [57]:
json_normalize(results)

   altitude  location_id status  location.lat  location.lng
0        35         2056     OK         42.97        -81.25
1        19         1979    NOK         42.11        -81.91
2        52         2030     OK         43.01        -81.00
3        89         2009     OK         41.99        -80.14
4        20         1999    NOK         40.19        -81.00

In [58]:
data = {
    "results": [
        {
            "altitude": 35,
            "location": {
                "lat": 42.97,
                "lng": -81.25
            },
            "location_id": 2056,
        },
        {
            "altitude": 19,
            "location": {
                "lat": 42.11,
                "lng": -81.91
            },
            "location_id": 1979,
        },
        {
            "altitude": 52,
            "location": {
                "lat": 43.01,
                "lng": -81.00
            },
            "location_id": 2030,
        },
        {
            "altitude" : 89,
            "location" : {
                "lat" : 41.99,
                "lng" : -80.14
            },
            "location_id": 2009,
        },
        {
            "altitude": 20,
            "location": {
                "lat": 40.19,
                "lng": -81.00
            },
            "location_id": 1999,
        }
    ],
    "status" : "OK"
}

In [59]:
data["results"]

[{'altitude': 35,
  'location': {'lat': 42.97, 'lng': -81.25},
  'location_id': 2056},
 {'altitude': 19,
  'location': {'lat': 42.11, 'lng': -81.91},
  'location_id': 1979},
 {'altitude': 52,
  'location': {'lat': 43.01, 'lng': -81.0},
  'location_id': 2030},
 {'altitude': 89,
  'location': {'lat': 41.99, 'lng': -80.14},
  'location_id': 2009},
 {'altitude': 20,
  'location': {'lat': 40.19, 'lng': -81.0},
  'location_id': 1999}]

In [60]:
json_normalize(data)

                                             results status
0  [{'altitude': 35, 'location': {'lat': 42.97, '...     OK

**J. PyR - Creating DataFrame**

| Python | Description | R | 
| --- | --- | --- | 
| `pd.DataFrame` | Creating Data Frame |  `data.frame` | 

`Python`
```Python
import numpy as np
import pandas as pd

data = {"StudentID": ["ST12", "AB34", "YW98", "ST34"],
        "Scores": [45, 98, 67, 89], 
        "Sport": ["Football", "Tennis", "Basketball", "Football"]}
df = pd.DataFrame(data)
```
`R`
```R
StudentID <- c("ST12", "AB34", "YW98", "ST34")
Scores <- c(45, 98, 67, 89)
Sport <- c("Football", "Tennis", "Basketball", "Football")
df <- data.frame(StudentID, Scores, Sport)
```

In [68]:
import numpy as np
import pandas as pd

data = {"StudentID": ["ST12", "AB34", "YW98", "ST34"],
        "Scores": [45, 98, 67, 89], 
        "Sport": ["Football", "Tennis", "Basketball", "Football"]}
df = pd.DataFrame(data)

In [69]:
df = pd.DataFrame(data)
df

  StudentID  Scores       Sport
0      ST12      45    Football
1      AB34      98      Tennis
2      YW98      67  Basketball
3      ST34      89    Football

**K. PyR - Data Inspection**

| Python | Description | R | 
| --- | --- | --- | 
| `df.head()` | Defauly View - top 5 rows |  `head(df)` | 
| `df.head(10)` | View top 10 rows |  `head(df, 6)` | 
| `df.tail()` | Default view - top 5 rows |  `tail(df)` | 
| `df.tail(10)` | View top 10 rows |  `tail(df, 6)` | 
| `df.columns` | Column names |  `colnames(df)` | 
| `df.shape` | Dataframe shape - dimension |  `dim(df)` | 
| `len(df)` | Length of Dataframe |  `length(df)` | 
| `df.info()` | Shows the description of data |  `str(df)` | 
| `df.describe()` | Provides quick summary of data |  `summary(df)` |

In [70]:
df["StudentID"]

0    ST12
1    AB34
2    YW98
3    ST34
Name: StudentID, dtype: object

**L. PyR - Some Operations**

| Python | Description | R | 
| --- | --- | --- | 
| `df["StudentID"]` or `df.StudentID` (without space column) | Select based on column |  `df$StudentID` or `df[, "StudentID"]` | 
| `df[["StudentID", "Scores"]]` | Select based on multiple columns |  `df[, c("StudentID", "Scores")]` | 
| `df.loc[:, "StudentID":"Scores"]` |  |  `dplyr` allows subset of columns -> `select(df, StudentID, Scores)` | 
| `df.iloc[:, 0:2]` | Select based on column index | `df[1:2]` | 
| `df.iloc[0:2]` | Select based on row index | `df[1:2,]` | 
| `df[0:2, 0:3]` |  |  `df[1:2, 1:3]` | 
| `df.sort_values(by='Scores')` | Sort based on column |  `df[order(df$Scores),]` |

In [98]:
df["StudentID"]

0    ST12
1    AB34
2    YW98
3    ST34
Name: StudentID, dtype: object

In [94]:
df[["StudentID", "Scores"]]

  StudentID  Scores
0      ST12      45
1      AB34      98
2      YW98      67
3      ST34      89

In [99]:
df.loc[:, "StudentID":"Scores"]

  StudentID  Scores
0      ST12      45
1      AB34      98
2      YW98      67
3      ST34      89

In [97]:
df.loc[df["StudentID"] == "YW98"]

  StudentID  Scores       Sport
2      YW98      67  Basketball

In [78]:
df.iloc[:, 0:2]

  StudentID  Scores
0      ST12      45
1      AB34      98
2      YW98      67
3      ST34      89

In [100]:
df.iloc[0:2, :]

  StudentID  Scores     Sport
0      ST12      45  Football
1      AB34      98    Tennis

In [79]:
df.iloc[0:2]

  StudentID  Scores     Sport
0      ST12      45  Football
1      AB34      98    Tennis

In [81]:
df.iloc[0:2, 0:3]

  StudentID  Scores     Sport
0      ST12      45  Football
1      AB34      98    Tennis

In [105]:
df.sort_values(by='Scores')

  StudentID  Scores       Sport
0      ST12      45    Football
2      YW98      67  Basketball
3      ST34      89    Football
1      AB34      98      Tennis

**M. PyR - Possible Cell and Line Magics**

In [64]:
%lsmagic

Available line magics:
%alias  %alias_magic  %autoawait  %autocall  %automagic  %autosave  %bookmark  %cd  %clear  %cls  %colors  %conda  %config  %connect_info  %copy  %ddir  %debug  %dhist  %dirs  %doctest_mode  %echo  %ed  %edit  %env  %gui  %hist  %history  %killbgscripts  %ldir  %less  %load  %load_ext  %loadpy  %logoff  %logon  %logstart  %logstate  %logstop  %ls  %lsmagic  %macro  %magic  %matplotlib  %mkdir  %more  %notebook  %page  %pastebin  %pdb  %pdef  %pdoc  %pfile  %pinfo  %pinfo2  %pip  %popd  %pprint  %precision  %prun  %psearch  %psource  %pushd  %pwd  %pycat  %pylab  %qtconsole  %quickref  %recall  %rehashx  %reload_ext  %ren  %rep  %rerun  %reset  %reset_selective  %rmdir  %run  %save  %sc  %set_env  %store  %sx  %system  %tb  %time  %timeit  %unalias  %unload_ext  %who  %who_ls  %whos  %xdel  %xmode

Available cell magics:
%%!  %%HTML  %%SVG  %%bash  %%capture  %%cmd  %%debug  %%file  %%html  %%javascript  %%js  %%latex  %%markdown  %%perl  %%prun  %%pypy  %%python  %%python2  %%python3  %%ruby  %%script  %%sh  %%svg  %%sx  %%system  %%time  %%timeit  %%writefile

Automagic is ON, % prefix IS NOT needed for line magics.

In [65]:
%%latex

$x$ = $\frac{2}{y}$

&copy; Mango Solutions